package com.xclink.ch02;

/*********************************
 * 6.
 * 一百元钱买一百鸡,公鸡每只五元整，每只母鸡是三元；
 * 小鸡因价格低，三只小鸡是一元；公鸡母鸡和小鸡，请你算出各是几？
 * @author Administrator
 *
 *********************************/

public class Exec6 {

	public static void main(String[] args) {
		
		int a = 0; //公鸡数量
		int b = 0; //母鸡数量
		int c = 0; //小鸡数量
		
		for(a=0;a<=20;a++){
			//100元最多能买20只公鸡
			for(b=0;b<=33;b++){
				//100元最多能买33只母鸡
				c = 100-a-b; //小鸡的数量
				
				if(5*a+3*b+c/3.0==100){
					//重点:体会修改为c/3后的答案是否正确？？
					//根据数量计算金额，如果为100元则打印
					System.out.println("公鸡数量:"+a+";母鸡数量:"+b+"小鸡数量:"+c);
				}
			}
		}
	}

}
